# IsFocalNode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalNode..::..IsFocalNode Property
MEPAnalyticalNode Class See Also
---
Is this node a focal point of multiple branches?
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool IsFocalNode { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsFocalNode As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsFocalNode {
	bool get ();
}
```

# See Also
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace